app/controllers/tips_controller.rb

  def get_tip
    rand_id = rand(Tip.count)
---
SELECT COUNT(*) FROM "tips"

  def index
    @tips = Tip.all
---
SELECT "tips".* FROM "tips"

  def create
    @tip = Tip.new(tip_params)

    respond_to do |format|
      if @tip.save
---
INSERT INTO "tips" ("tip", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tip", "Always count your change, son"], ["created_at", "2016-06-02 20:14:59.697645"], ["updated_at", "2016-06-02 20:14:59.697645"]]

    def set_tip
      @tip = Tip.find(params[:id])
---
SELECT  "tips".* FROM "tips" WHERE "tips"."id" = $1 LIMIT 1  [["id", 1]]